### Q1. List any five functions of the pandas library with execution.

In [3]:
import pandas as pd

First download any dataset.Note:File should be in the same directory

In [5]:
# pd.read_csv() --> used to read a csv file
df = pd.read_csv("titanic.csv")
#read_csv() – Used to read a CSV file into a DataFrame.

In [13]:
#head() – Returns the first N rows of the DataFrame.
df.head()   # default provides 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [14]:
#tail() – Returns the last N rows of the DataFrame.
df.tail()    # default provides 5 rows

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [16]:
#drop() – Removes specified rows or columns.
df_dropped = df.drop(columns=['Cabin'])
print("\nAfter dropping 'Cabin' column:")
print(df_dropped.head(4))

After dropping 'Cabin' column:
   PassengerId  Survived  Pclass                              Name     Sex  \
0          892         0       3                  Kelly, Mr. James    male
1          893         1       3  Wilkes, Mrs. James (Ellen Needs)  female
2          894         0       2         Myles, Mr. Thomas Francis    male
3          895         0       3                  Wirz, Mr. Albert    male

    Age  SibSp  Parch  Ticket    Fare Embarked
0  34.5      0      0  330911  7.8292        Q
1  47.0      1      0  363272  7.0000        S
2  62.0      0      0  240276  9.6875        Q
3  27.0      0      0  315154  8.6625        S

In [18]:
#groupby() – Groups data based on a specified column.
#Group by 'Sex' and calculate average 'Age' and 'Survived'
grouped = df.groupby('Sex')[['Age', 'Survived']].mean()
print("\nGrouped by 'Sex' – Average Age and Survival Rate:")
print(grouped)

Grouped by 'Sex' – Average Age and Survival Rate:
              Age  Survived
Sex
female  30.272362       1.0
male    30.272732       0.0

In [19]:
#describe()- for only numerical data
df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,418.000000,418.000000,418.000000,332.000000,418.000000,418.000000,417.000000
mean,1100.500000,0.363636,2.265550,30.272590,0.447368,0.392344,35.627188
std,120.810458,0.481622,0.841838,14.181209,0.896760,0.981429,55.907576
min,892.000000,0.000000,1.000000,0.170000,0.000000,0.000000,0.000000
25%,996.250000,0.000000,1.000000,21.000000,0.000000,0.000000,7.895800
50%,1100.500000,0.000000,3.000000,27.000000,0.000000,0.000000,14.454200
75%,1204.750000,1.000000,3.000000,39.000000,1.000000,0.000000,31.500000
max,1309.000000,1.000000,3.000000,76.000000,8.000000,9.000000,512.329200

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [21]:
import pandas as pd

def reindex_df(df):
    df.index = range(1, len(df)*2, 2)
    return df

# Example DataFrame
df = pd.DataFrame({'A': [10, 25, 34], 'B': [47, 58, 61], 'C': [75, 82, 91]})
print(reindex_df(df))

    A   B   C
1  10  47  75
3  25  58  82
5  34  61  91

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console. For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [22]:
def sum_first_three(df):
    sum_values = df['Values'].head(3).sum()
    print(sum_values)

# Example DataFrame
df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
sum_first_three(df)

60

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [23]:
def add_word_count(df):
    df['Word_Count'] = df['Text'].apply(lambda x: len(str(x).split()))
    return df

# Example DataFrame
df = pd.DataFrame({'Text': ['Hello world', 'Pandas is great', 'Python programming']})
print(add_word_count(df))

                 Text  Word_Count
0         Hello world           2
1     Pandas is great           3
2  Python programming           2

### Q5. How are DataFrame.size() and DataFrame.shape() different?

**DataFrame.size:** Returns the total number of elements (rows * columns) in the DataFrame.

**DataFrame.shape:** Returns a tuple with the number of rows and columns (rows, columns).

In [24]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
print(df.size)  # Output: 6
print(df.shape)

6
(3, 2)

### Q6. Which function of pandas do we use to read an excel file?

The function used to read an Excel file is read_excel().  
df = pd.read_excel('file.xlsx')  
print(df.head())

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [26]:
def extract_username(df):
    df['Username'] = df['Email'].apply(lambda x: x.split('@')[0])
    return df

# Example DataFrame
df = pd.DataFrame({'Email': ['john.doe@example.com', 'james.smith@example.com','steve.rogers@example.com']})
print(extract_username(df))

                      Email      Username
0      john.doe@example.com      john.doe
1   james.smith@example.com   james.smith
2  steve.rogers@example.com  steve.rogers

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects  all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The  function should return a new DataFrame that contains only the selected rows.  

For example, if df contains the following values:  
  
__A B C  
0 3 5 1  
1 8 2 7  
2 6 9 4  
3 2 3 5  
4 9 1 2  
 
Your function should select the following rows: 

__A B C     
1 8 2 7     
4 9 1 2   
The function should return a new DataFrame that contains only the selected rows.

In [27]:
def select_rows(df):
    filtered_df = df[(df['A'] > 5) & (df['B'] < 10)]
    return filtered_df

# Example DataFrame
df = pd.DataFrame({'A': [3, 8, 6, 2, 9], 'B': [5, 2, 9, 3, 1], 'C': [1, 7, 4, 5, 2]})
print(select_rows(df))

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,median, and standard deviation of the values in the 'Values' column.

In [29]:
def calculate_stats(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std_dev = df['Values'].std()
    print(f"Mean: {mean}, Median: {median}, Standard Deviation: {std_dev}")

# Example DataFrame
df = pd.DataFrame({'Values': [16, 80, 54, 42, 19]})
calculate_stats(df)

Mean: 42.2, Median: 42.0, Standard Deviation: 26.42347441196937

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [30]:
def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

# Example DataFrame
df = pd.DataFrame({'Date': pd.date_range(start='2023-01-01', periods=10, freq='D'), 'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]})
print(calculate_moving_average(df))

        Date  Sales  MovingAverage
0 2023-01-01     10           10.0
1 2023-01-02     20           15.0
2 2023-01-03     30           20.0
3 2023-01-04     40           25.0
4 2023-01-05     50           30.0
5 2023-01-06     60           35.0
6 2023-01-07     70           40.0
7 2023-01-08     80           50.0
8 2023-01-09     90           60.0
9 2023-01-10    100           70.0

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:  
Date   
0 2023-01-01  
1 2023-01-02  
2 2023-01-03  
3 2023-01-04   
4 2023-01-05   

Your function should create the following DataFrame:   
Date Weekday   
0 2023-01-01 Sunday   
1 2023-01-02 Monday  
2 2023-01-03 Tuesday  
3 2023-01-04 Wednesday   
4 2023-01-05 Thursday    
The function should return the modified DataFrame.

In [31]:
def add_weekday(df):
    df['Weekday'] = df['Date'].dt.day_name()
    return df

# Example DataFrame
df = pd.DataFrame({'Date': pd.to_datetime(['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05'])})
print(add_weekday(df))

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [32]:
def select_date_range(df):
    df['Date'] = pd.to_datetime(df['Date'])
    filtered_df = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    return filtered_df

# Example DataFrame
df = pd.DataFrame({'Date': ['2023-01-01', '2023-01-15', '2023-02-01', '2023-01-25']})
print(select_date_range(df))

        Date
0 2023-01-01
1 2023-01-15
3 2023-01-25

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

The first and foremost necessary library that needs to be imported is pandas: 
#### import pandas as pd  
This imports the Pandas library with the alias pd, which is the standard practice